doc/slides/slide_summary_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Résumé sur les classes</title>
<!-- 2013-10-19 sam. 16:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="slide_compilation.html">Compilation & Directives de préprocesseur </a><a href="slide_pointeur.html">Pointeurs, Références & Allocation Dynamique de Mémoire </a><a href="slide_specificite_c++.html">Spécificités du C++ (indépendantes de la POO) </a><a href="slide_struct_class.html">Structures & Classes </a><aa>Encapsulation des données </aa><aa>Constructeur & Destructeur de classe </aa><aa>Amitié & Surcharge d'opérateur </aa><aa>Héritage (Partie 1) </aa><aa>Héritage (Partie 2) </aa><aa>Patrons de fonctions et de classes </aa><aa>Introduction à la librairie standard </aa>
                     <hr/>
                     <a href="../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Résumé sur les classes</h1><hr/>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Principales notions</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Structure de données : la classe est <b>une extension de la notion de type</b>
</li>

<li>Encapsulation des données : <b>forme de protection des données</b> vis-à-vis des
objets extérieurs à la classe
</li>

<li>Le constructeur et le destructeur sont deux <b>méthodes <i>i.e.</i> fonctions
membres</b> particulières utilisées respectivement à l&rsquo;initialisation et à &ldquo;la
destruction&rdquo; de l&rsquo;objet
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Classe <code>particule</code></h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Fichier <code>particule.h</code></h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#if</span><span class="org-preprocessor"><span class="org-negation-char">n</span></span><span class="org-preprocessor">def</span> __particule_h__
<span class="org-preprocessor">#define</span> <span class="org-variable-name">__particule_h__</span> 1
<span class="org-keyword">class</span> <span class="org-type">particule</span>
{
};
<span class="org-preprocessor">#endif</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Déclaration des membres&#x2026;</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Fichier <code>particule.h</code></h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#if</span><span class="org-preprocessor"><span class="org-negation-char">n</span></span><span class="org-preprocessor">def</span> __particule_h__
<span class="org-preprocessor">#define</span> <span class="org-variable-name">__particule_h__</span> 1
<span class="org-keyword">class</span> <span class="org-type">particule</span>
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">Encapsulation</span>
<span class="org-keyword">private</span>:
  <span class="org-type">double</span> <span class="org-variable-name">m_masse</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_charge</span>;
};
<span class="org-preprocessor">#endif</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">&#x2026; et des méthodes associées</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Fichier <code>particule.h</code></h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#if</span><span class="org-preprocessor"><span class="org-negation-char">n</span></span><span class="org-preprocessor">def</span> __particule_h__
<span class="org-preprocessor">#define</span> <span class="org-variable-name">__particule_h__</span> 1
<span class="org-keyword">class</span> <span class="org-type">particule</span>
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">Non encapsul&#233;</span>
<span class="org-keyword">public</span>:
  <span class="org-type">double</span> <span class="org-function-name">get_masse</span>  () <span class="org-keyword">const</span>;
  <span class="org-type">double</span> <span class="org-function-name">get_charge</span> () <span class="org-keyword">const</span>;

  <span class="org-type">void</span> <span class="org-function-name">set_masse</span>  (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">masse_</span>);
  <span class="org-type">void</span> <span class="org-function-name">set_charge</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">charge_</span>);

<span class="org-keyword">private</span>:
  <span class="org-type">double</span> <span class="org-variable-name">m_masse</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_charge</span>;
};
<span class="org-preprocessor">#endif</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Déclaration des constructeurs/destructeur</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Fichier <code>particule.h</code></h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#if</span><span class="org-preprocessor"><span class="org-negation-char">n</span></span><span class="org-preprocessor">def</span> __particule_h__
<span class="org-preprocessor">#define</span> <span class="org-variable-name">__particule_h__</span> 1
<span class="org-keyword">class</span> <span class="org-type">particule</span>
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">Non encapsul&#233;</span>
<span class="org-keyword">public</span>:
  <span class="org-function-name">particule</span>  ();
  <span class="org-function-name">particule</span>  (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">masse_</span>, <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">charge_</span>);
  ~<span class="org-function-name">particule</span> ();

  ...

  <span class="org-keyword">private</span>:
  <span class="org-type">double</span> m_masse;
  <span class="org-type">double</span> <span class="org-variable-name">m_charge</span>;
};
<span class="org-preprocessor">#endif</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Définition de la classe (1/2)</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Fichier <code>particule.cc</code></h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">"particule.h"</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Constructeur par d&#233;faut</span>
<span class="org-constant">particule</span>::<span class="org-function-name">particule</span> () : m_masse  (0.0),
                          m_charge (0.0)
{
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Surd&#233;finition du constructeur</span>
<span class="org-constant">particule</span>::<span class="org-function-name">particule</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">masse_</span>, <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">charge_</span>)
  : m_masse (masse_), m_charge (charge_)
{
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Destructeur</span>
<span class="org-constant">particule</span>::~<span class="org-function-name">particule</span> ()
{
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Définition de la classe (2/2)</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">Fichier <code>particule.cc</code></h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">double</span> <span class="org-constant">particule</span>::<span class="org-function-name">get_masse</span> () <span class="org-keyword">const</span>
{
  <span class="org-keyword">return</span> m_masse;
}

<span class="org-type">double</span> <span class="org-constant">particule</span>::<span class="org-function-name">get_charge</span> () <span class="org-keyword">const</span>
{
  <span class="org-keyword">return</span> m_charge;
}

<span class="org-type">void</span> <span class="org-constant">particule</span>::<span class="org-function-name">set_masse</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">masse_</span>)
{
  m_masse = masse_;
}

<span class="org-type">void</span> <span class="org-constant">particule</span>::<span class="org-function-name">set_charge</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">charge_</span>)
{
  m_charge = charge_;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Programme test de la classe</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">Fichier <code>test_particule.cc</code></h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">"particule.h"</span>

<span class="org-type">int</span> <span class="org-function-name">main</span> ()
{
  <span class="org-type">particule</span> <span class="org-variable-name">my_particule1</span> (0.511, 1.6e-19);
  <span class="org-type">particule</span> <span class="org-variable-name">my_particule2</span>;
}
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
